{"name":"Artery","properties":{"code":{"description":"A medical code for the entity, taken from a controlled vocabulary or  ontology such as ICD-9, DiseasesDB, MeSH, SNOMED-CT, RxNorm, etc.","type":"MedicalCode"},"relatedCondition":{"description":"A medical condition associated with this anatomy.","type":"MedicalCondition"},"guideline":{"description":"A medical guideline related to this entity.","type":"MedicalGuideline"},"study":{"description":"A medical study or trial related to this entity.","type":"MedicalStudy"},"relatedTherapy":{"description":"A medical therapy related to this anatomy.","type":"MedicalTherapy"},"description":{"description":"A short description of the item.","type":"string"},"additionalType":{"description":"An additional type for the item, typically used for adding more specific  types from external vocabularies in microdata syntax. This is a  relationship between something and a class that the thing is in. In RDFa  syntax, it is better to use the native RDFa syntax - the 'typeof' attribute  - for multiple types. Schema.org tools may have only weaker understanding  of extra types, in particular those defined externally.","type":"URL"},"alternateName":{"description":"An alias for the item.","type":"string"},"diagram":{"description":"An image containing a diagram that illustrates the structure and/or its  component substructures and/or connections with other structures.","type":"ImageObject"},"image":{"description":"An image of the item. This can be a URL or a fully described ImageObject.","type":"URL"},"subStructure":{"description":"Component (sub-)structure(s) that comprise this anatomical structure.","type":"AnatomicalStructure"},"function":{"description":"Function of the anatomical structure.","type":"string"},"associatedPathophysiology":{"description":"If applicable, a description of the pathophysiology associated with the  anatomical system, including potential abnormal changes in the mechanical,  physical, and biochemical functions of the system.","type":"string"},"relevantSpecialty":{"description":"If applicable, a medical specialty in which this entity is relevant.","type":"MedicalSpecialty"},"recognizingAuthority":{"description":"If applicable, the organization that officially recognizes this entity as  part of its endorsed system of medicine.","type":"Organization"},"mainEntityOfPage":{"description":"Indicates a page (or other CreativeWork) for which this thing is the main  entity being described.  See background notes for details. Inverse property: mainEntity.","type":"URL"},"potentialAction":{"description":"Indicates a potential Action, which describes an idealized action in which  this thing would play an 'object' role.","type":"Action"},"bodyLocation":{"description":"Location in the body of the anatomical structure.","type":"string"},"connectedTo":{"description":"Other anatomical structures to which this structure is connected.","type":"AnatomicalStructure"},"source":{"description":"The anatomical or organ system that the artery originates from.","type":"AnatomicalStructure"},"partOfSystem":{"description":"The anatomical or organ system that this structure is part of.","type":"AnatomicalSystem"},"supplyTo":{"description":"The area to which the artery supplies blood.","type":"AnatomicalStructure"},"arterialBranch":{"description":"The branches that comprise the arterial structure.","type":"AnatomicalStructure"},"name":{"description":"The name of the item.","type":"string"},"medicineSystem":{"description":"The system of medicine that includes this MedicalEntity, for example  'evidence-based', 'homeopathic', 'chiropractic', etc.","type":"MedicineSystem"},"sameAs":{"description":"URL of a reference Web page that unambiguously indicates the item's  identity. E.g. the URL of the item's Wikipedia page, Freebase page, or  official website.","type":"URL"},"url":{"description":"URL of the item.","type":"URL"}}}