{"name":"BusTrip","properties":{"description":{"description":"A short description of the item.","type":"string"},"additionalType":{"description":"An additional type for the item, typically used for adding more specific  types from external vocabularies in microdata syntax. This is a  relationship between something and a class that the thing is in. In RDFa  syntax, it is better to use the native RDFa syntax - the 'typeof' attribute  - for multiple types. Schema.org tools may have only weaker understanding  of extra types, in particular those defined externally.","type":"URL"},"alternateName":{"description":"An alias for the item.","type":"string"},"image":{"description":"An image of the item. This can be a URL or a fully described ImageObject.","type":"ImageObject"},"mainEntityOfPage":{"description":"Indicates a page (or other CreativeWork) for which this thing is the main  entity being described.  See background notes for details. Inverse property: mainEntity.","type":"URL"},"potentialAction":{"description":"Indicates a potential Action, which describes an idealized action in which  this thing would play an 'object' role.","type":"Action"},"arrivalTime":{"description":"The expected arrival time.","type":"DateTime"},"departureTime":{"description":"The expected departure time.","type":"DateTime"},"busName":{"description":"The name of the bus (e.g. Bolt Express).","type":"string"},"name":{"description":"The name of the item.","type":"string"},"provider":{"description":"The service provider, service operator, or service performer; the goods  producer. Another party (a seller) may offer those services or goods on  behalf of the provider. A provider may also serve as the seller. Supersedes  carrier.","type":"Person"},"arrivalBusStop":{"description":"The stop or station from which the bus arrives.","type":"BusStation"},"departureBusStop":{"description":"The stop or station from which the bus departs.","type":"BusStation"},"busNumber":{"description":"The unique identifier for the bus.","type":"string"},"sameAs":{"description":"URL of a reference Web page that unambiguously indicates the item's  identity. E.g. the URL of the item's Wikipedia page, Freebase page, or  official website.","type":"URL"},"url":{"description":"URL of the item.","type":"URL"}}}