{"name":"FoodEstablishmentReservation","properties":{"description":{"description":"A short description of the item.","type":"string"},"reservedTicket":{"description":"A ticket associated with the reservation.","type":"Ticket"},"reservationId":{"description":"A unique identifier for the reservation.","type":"string"},"additionalType":{"description":"An additional type for the item, typically used for adding more specific  types from external vocabularies in microdata syntax. This is a  relationship between something and a class that the thing is in. In RDFa  syntax, it is better to use the native RDFa syntax - the 'typeof' attribute  - for multiple types. Schema.org tools may have only weaker understanding  of extra types, in particular those defined externally.","type":"URL"},"alternateName":{"description":"An alias for the item.","type":"string"},"broker":{"description":"An entity that arranges for an exchange between a buyer and a seller. In  most cases a broker never acquires or releases ownership of a product or  service involved in an exchange. If it is not clear whether an entity is a  broker, seller, or buyer, the latter two terms are preferred. Supersedes  bookingAgent.","type":"Person"},"image":{"description":"An image of the item. This can be a URL or a fully described ImageObject.","type":"ImageObject"},"programMembershipUsed":{"description":"Any membership in a frequent flyer, hotel loyalty program, etc. being  applied to the reservation.","type":"ProgramMembership"},"mainEntityOfPage":{"description":"Indicates a page (or other CreativeWork) for which this thing is the main  entity being described.  See background notes for details. Inverse property: mainEntity.","type":"URL"},"potentialAction":{"description":"Indicates a potential Action, which describes an idealized action in which  this thing would play an 'object' role.","type":"Action"},"partySize":{"description":"Number of people the reservation should accommodate.","type":"Integer"},"priceCurrency":{"description":"The currency (in 3-letter ISO 4217 format) of the price or a price  component, when attached to PriceSpecification and its subtypes.","type":"string"},"reservationStatus":{"description":"The current status of the reservation.","type":"ReservationStatusType"},"bookingTime":{"description":"The date and time the reservation was booked.","type":"DateTime"},"modifiedTime":{"description":"The date and time the reservation was modified.","type":"DateTime"},"endTime":{"description":"The endTime of something. For a reserved event or service (e.g.  FoodEstablishmentReservation), the time that it is expected to end. For  actions that span a period of time, when the action was performed. e.g.  John wrote a book from January to *December*. Note that Event uses  startDate/endDate instead of startTime/endTime, even when describing dates  with times. This situation may be clarified in future revisions.","type":"DateTime"},"name":{"description":"The name of the item.","type":"string"},"underName":{"description":"The person or organization the reservation or ticket is for.","type":"Person"},"provider":{"description":"The service provider, service operator, or service performer; the goods  producer. Another party (a seller) may offer those services or goods on  behalf of the provider. A provider may also serve as the seller. Supersedes  carrier.","type":"Person"},"startTime":{"description":"The startTime of something. For a reserved event or service (e.g.  FoodEstablishmentReservation), the time that it is expected to start. For  actions that span a period of time, when the action was performed. e.g.  John wrote a book from *January* to December. Note that Event uses  startDate/endDate instead of startTime/endTime, even when describing dates  with times. This situation may be clarified in future revisions.","type":"DateTime"},"reservationFor":{"description":"The thing -- flight, event, restaurant,etc. being reserved.","type":"Thing"},"totalPrice":{"description":"The total price for the reservation or ticket, including applicable taxes,  shipping, etc.","type":"PriceSpecification"},"sameAs":{"description":"URL of a reference Web page that unambiguously indicates the item's  identity. E.g. the URL of the item's Wikipedia page, Freebase page, or  official website.","type":"URL"},"url":{"description":"URL of the item.","type":"URL"}}}