{
  "name": "OfferCatalog",
  "properties": {
    "description": {
      "type": "string",
      "description": "A short description of the item."
    },
    "additionalType": {
      "type": "string",
      "description": "An additional type for the item, typically used for adding more specific  types from external vocabularies in microdata syntax. This is a  relationship between something and a class that the thing is in. In RDFa  syntax, it is better to use the native RDFa syntax - the 'typeof' attribute  - for multiple types. Schema.org tools may have only weaker understanding  of extra types, in particular those defined externally."
    },
    "alternateName": {
      "type": "string",
      "description": "An alias for the item."
    },
    "image": {
      "type": "string",
      "description": "An image of the item. This can be a URL or a fully described ImageObject."
    },
    "itemListElement": {
      "type": "string",
      "description": "For itemListElement values, you can use simple strings (e.g. \"Peter"
    },
    "mainEntityOfPage": {
      "type": "string",
      "description": "Indicates a page (or other CreativeWork) for which this thing is the main  entity being described.  See background notes for details. Inverse property: mainEntity."
    },
    "potentialAction": {
      "type": "string",
      "description": "Indicates a potential Action, which describes an idealized action in which  this thing would play an 'object' role."
    },
    "name": {
      "type": "string",
      "description": "The name of the item."
    },
    "numberOfItems": {
      "type": "string",
      "description": "The number of items in an ItemList. Note that some descriptions might not  fully describe all items in a list (e.g., multi-page pagination); in such  cases, the numberOfItems would be for the entire list."
    },
    "itemListOrder": {
      "type": "string",
      "description": "Type of ordering (e.g. Ascending, Descending, Unordered)."
    },
    "sameAs": {
      "type": "string",
      "description": "URL of a reference Web page that unambiguously indicates the item's  identity. E.g. the URL of the item's Wikipedia page, Freebase page, or  official website."
    },
    "url": {
      "type": "string",
      "description": "URL of the item."
    }
  },
  "validations": [],
  "relations": {},
  "acls": [],
  "methods": {}
}
