{
  "name": "QuantitativeValue",
  "properties": {
    "valueReference": {
      "type": "string",
      "description": "A pointer to a secondary value that provides additional information on the  original value, e.g. a reference temperature."
    },
    "additionalProperty": {
      "type": "string",
      "description": "A property-value pair representing an additional characteristics of the  entitity, e.g. a product feature or another characteristic for which there  is no matching property in schema.org.  Note: Publishers should be aware that applications designed to use specific  schema.org properties (e.g. http://schema.org/width,  http://schema.org/color, http://schema.org/gtin13, ...) will typically  expect such data to be provided using those properties, rather than using  the generic property/value mechanism."
    },
    "description": {
      "type": "string",
      "description": "A short description of the item."
    },
    "unitText": {
      "type": "string",
      "description": "A string or text indicating the unit of measurement. Useful if you cannot  provide a standard unit code for unitCode."
    },
    "additionalType": {
      "type": "string",
      "description": "An additional type for the item, typically used for adding more specific  types from external vocabularies in microdata syntax. This is a  relationship between something and a class that the thing is in. In RDFa  syntax, it is better to use the native RDFa syntax - the 'typeof' attribute  - for multiple types. Schema.org tools may have only weaker understanding  of extra types, in particular those defined externally."
    },
    "alternateName": {
      "type": "string",
      "description": "An alias for the item."
    },
    "image": {
      "type": "string",
      "description": "An image of the item. This can be a URL or a fully described ImageObject."
    },
    "mainEntityOfPage": {
      "type": "string",
      "description": "Indicates a page (or other CreativeWork) for which this thing is the main  entity being described.  See background notes for details. Inverse property: mainEntity."
    },
    "potentialAction": {
      "type": "string",
      "description": "Indicates a potential Action, which describes an idealized action in which  this thing would play an 'object' role."
    },
    "minValue": {
      "type": "string",
      "description": "The lower value of some characteristic or property."
    },
    "name": {
      "type": "string",
      "description": "The name of the item."
    },
    "unitCode": {
      "type": "string",
      "description": "The unit of measurement given using the UN/CEFACT Common Code (3  characters) or a URL. Other codes than the UN/CEFACT Common Code may be  used with a prefix followed by a colon."
    },
    "maxValue": {
      "type": "string",
      "description": "The upper value of some characteristic or property."
    },
    "value": {
      "type": "string",
      "description": "The value of the quantitative value or property value node. For  QuantitativeValue, the recommended type for values is 'Number'. For  PropertyValue, it can be 'Text;', 'Number', 'Boolean', or 'StructuredValue'."
    },
    "sameAs": {
      "type": "string",
      "description": "URL of a reference Web page that unambiguously indicates the item's  identity. E.g. the URL of the item's Wikipedia page, Freebase page, or  official website."
    },
    "url": {
      "type": "string",
      "description": "URL of the item."
    }
  },
  "validations": [],
  "relations": {},
  "acls": [],
  "methods": {}
}
